florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- Shifter gear tracking ----
static uint8_t  lastSentGear      = 0xFF;    // last gear value sent to STM32
static unsigned long lastGearSendMs = 0;     // debounce for gear CAN sends
static constexpr unsigned long GEAR_SEND_DEBOUNCE_MS = 100;
static constexpr uint8_t GEAR_REVERSE = 1;   // shifter raw value for Reverse

// ---- Mode state tracking ----
static uint8_t  currentModeFlags  = 0;       // Current mode flags (bit 0=4x4, bit 1=tank)

// ---- Drive-mode sync FSM (physical 4x4 selector = source of truth) ----
// The debounced selector latches its state into g_modeSync.setDesired(); the
// FSM defers the actual CMD_MODE transmission until the STM32 heartbeat is
// confirmed and (re)transmits until an ACK arrives or a bounded retry budget
// is exhausted.  Logic lives in the pure, host-tested mode_sync.h.
static constexpr uint8_t MODE_SYNC_MAX_RETRIES = 3;
static ModeSync      g_modeSync(can::ACK_TIMEOUT_MS, MODE_SYNC_MAX_RETRIES);
static unsigned long g_modeSendMs   = 0;     // millis() of last FSM-driven send
static unsigned long g_lastModeAckTs = 0;    // last CMD_MODE ACK consumed by FSM
static unsigned long g_lastModeEchoTs = 0;   // last heartbeat frame fed as mode echo

// ---- Power/Audio state tracking ----
static bool     welcomePlayed     = false;
static bool     farewellPlayed    = false;
static uint8_t  lastAppliedAudioVolume = 15;
static unsigned long lastRemoteVolumeSetMs = 0;
static constexpr unsigned long REMOTE_VOLUME_DEBOUNCE_MS = 250;
static constexpr uint8_t       REMOTE_VOLUME_HYSTERESIS  = 2;
// Brownout/reboot guard: minimum interval between WELCOME sounds.
// On rapid MCU resets (brownout, watchdog) the ESP32 may restart
// multiple times in quick succession.  This timestamp prevents audio
// spam by enforcing a cooldown.  NOTE: static RAM is NOT guaranteed
// to persist across all reset types on all ESP32 variants.  On a
// full power cycle, lastWelcomePlayMs reinitialises to 0 (desired:
// fresh boot always plays welcome).  On brownout or SW reset, the
// per-sound cooldown in audio_manager.cpp (SOUND_COOLDOWN_MS=4s)
// provides a secondary safety net even if this variable is lost.
static unsigned long lastWelcomePlayMs = 0;
static constexpr unsigned long WELCOME_COOLDOWN_MS = 5000;  // 5 s minimum gap

// ---- Runtime overlay state ----
static bool     showOverlay       = true;    // overlay visible on initial screen only
static uint32_t lastFrameStart    = 0;

// ---- Render heartbeat (audit P2) ----
// Monotonic millis() timestamp published by renderTask at the END of every
// fully completed frame, i.e. AFTER screenManager.update(), all TFT drawing,
// the centralized touch read, and the implicit release of the shared SPI bus.
// Core-1 (loop) reads this to feed the DisplaySupervisor; the heartbeat only
// advances when a frame truly finished, so a hung render/SPI transaction is
// observable as a stalled timestamp.  volatile: written on Core 0, read on
// Core 1 (a single aligned 32-bit word — atomic on the ESP32-S3).
static volatile uint32_t renderHeartbeatMs = 0;
static volatile uint32_t renderFrameCounter = 0;

// ---- Core-1 → Core-0 TFT recovery request (audit P2 §4) ----
// The white-screen fault must be recovered with EXCLUSIVE bus ownership from
// the Core-0 render task; Core 1 must NEVER call TFT_eSPI.  Core 1 (loop /
// supervisor) only posts a request into this mailbox, and Core 0 executes the
// hardware choreography (display_recovery.h) and reports the result back.  The
// pure handshake logic lives in display::RecoveryRequestMailbox (host-tested in
// test_display_recovery.cpp); the portMUX below makes the two-core access safe.
static display::RecoveryRequestMailbox g_recoveryMailbox;
static portMUX_TYPE g_recoveryMux = portMUX_INITIALIZER_UNLOCKED;

// Bench/manual "the panel went white" request (audit §4.2).  Because the white
// screen is NOT automatically observable with the current wiring (no reliable
// readback, no reset-signal latch), an operator/bench path can explicitly
// request a recovery.  Set from Core 1 (serial command / future HMI button).
static volatile bool g_manualRecoveryRequest = false;

// Optional latched TFT reset-signal evidence (audit §4.3).  Remains false
// unless a real hardware latch on TFT_RST/GPIO38 is wired and sets it; the
// firmware never fabricates this signal, so white is never asserted from it
// unless the hardware truly observed a reset.
static volatile bool g_tftResetSignalLatched = false;

// Core-1 entry point to request a recovery.  Thread-safe; posts into the
// mailbox only if none is pending / in flight.  Returns true if accepted.
static bool requestDisplayRecovery(display::RecoveryTrigger trigger) {
    bool accepted;
    taskENTER_CRITICAL(&g_recoveryMux);
    accepted = g_recoveryMailbox.request(trigger);
    taskEXIT_CRITICAL(&g_recoveryMux);
    return accepted;
}

// ---- Audio event tracking ----
static uint8_t  lastAudioSystemState = 0;     // detect state transitions for error alert
static bool     batteryLowPlayed  = false;     // one-shot for battery warning
static bool     batteryCritPlayed = false;     // one-shot for battery critical
static constexpr uint16_t BATTERY_LOW_THRESHOLD_RAW = 2000;  // 20.00 V in 0.01 V units
static constexpr uint16_t BATTERY_CRIT_THRESHOLD_RAW = 1800; // 18.00 V in 0.01 V units
static unsigned long lastObstacleWarnMs = 0;   // debounce obstacle warning beeps
static constexpr unsigned long OBSTACLE_WARN_INTERVAL_MS = 2000;

// ---- Runtime counter for maintenance tracking ----
static unsigned long lastRuntimeTickMs = 0;
static uint32_t      runtimeAccumMs    = 0;       // partial seconds accumulated in RAM (§2.2)
static constexpr unsigned long RUNTIME_COMMIT_INTERVAL_MS = 60000;  // commit to NVS every 60 s
static bool     maintenanceWarnPlayed = false;

// ---- Temperature audio tracking ----
static bool     tempHighPlayed = false;        // one-shot for temp high warning
static constexpr int8_t TEMP_HIGH_THRESHOLD = 85;  // °C — play alert above this
static constexpr int8_t TEMP_HIGH_HYSTERESIS = 5;  // °C — hysteresis to prevent oscillation

