florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Initialize WS2812B LED controller (front GPIO 47 + rear GPIO 48)
    led_ctrl::init();

    // Initialize power manager (ignition key on GPIO 40/41)
    power_mgr::init();

    // Initialize DFPlayer audio (UART2 on GPIO 43/44)
    audio::init();

    // Initialize MCP23017 shifter input (I2C on GPIO 8/9)
    shifter::init();

    // Initialize remote control parser (FlySky FS-iA6B iBUS, GPIO 16 RX).
    // Enabled by default (REMOTE_CONTROL_ENABLED=1 in platformio.ini);
    // compiles to an inline no-op when the flag is set to 0.  See
    // docs/REMOTE_CONTROL_IMPLEMENTATION_PLAN.md Phase 2.
    remote_control::init();

    // Initialize traction switch (DPDT rocker on GPIO 15)
    traction_sw::init();

    // Initialize centralized touch handler
    touch::init();

    // Apply saved configuration
    {
        const auto& cfg = config_store::get();
        // Traction mode is now read from physical switch, not NVS
        currentModeFlags   = traction_sw::getModeFlag()
                           | (cfg.driveMode & can::MODE_FLAG_TANK_TURN);
        frontLedLocalState = cfg.frontLedEnabled;
        rearLedLocalState  = cfg.rearLedEnabled;

        // Apply saved audio volume to DFPlayer
        audio::setVolume(cfg.audioVolume);
        lastAppliedAudioVolume = cfg.audioVolume;

        // Restore saved LED decorative mode
        led_ctrl::setDecorMode(static_cast<led_ctrl::DecorMode>(cfg.ledMode));

        // Populate vehicleData with initial mode flags
        vehicle::ModeData md;
        md.modeFlags   = currentModeFlags;
        md.timestampMs = millis();
        vehicleData.setMode(md);
    }

    // Create render task on Core 0 — offloads all TFT and touch operations
    // from the main loop, preventing SPI blocking on Core 1.
    vdMutex = xSemaphoreCreateMutex();
    touchActionQueue = xQueueCreate(8, sizeof(TouchAction));
    if (vdMutex == nullptr || touchActionQueue == nullptr) {
        Serial.println("[BOOT][ERR] Failed to create render task resources");
        // Fall through — render task won't be created, TFT won't update.
        // System is still safe (CAN, safety, LEDs continue on Core 1).
    } else {
        BaseType_t rc = xTaskCreatePinnedToCore(
            renderTask, "Render", 16384, nullptr, 1, &renderTaskHandle, 0);
        if (rc != pdPASS) {
            Serial.println("[BOOT][ERR] Failed to create render task");
        } else {
            Serial.println("[BOOT][INFO] Render task started on Core 0");
        }
    }

    // Boot-diagnostics telemetry — single machine-parseable line emitted once
    // per boot on the serial channel (the ESP32 HMI is CAN receive-only, so it
    // has no diagnostic-frame TX path).  Captures the reset cause plus the heap
    // low-water mark and both task stack high-watermarks so brownouts, panics,
    // watchdog resets, heap exhaustion and stack pressure are all observable
    // from the boot log.  Formatting/classification lives in the host-tested
    // boot_diag module; this is pure instrumentation.
    {
        boot_diag::HeapStats hs;
        hs.freeNow      = (uint32_t)esp_get_free_heap_size();
        hs.minFreeEver  = (uint32_t)esp_get_minimum_free_heap_size();
        hs.totalSize    = (uint32_t)ESP.getHeapSize();
        hs.largestBlock = (uint32_t)ESP.getMaxAllocHeap();
        uint32_t loopHwm   = (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
        uint32_t renderHwm = (renderTaskHandle != nullptr)
                           ? (uint32_t)uxTaskGetStackHighWaterMark(renderTaskHandle)
                           : 0u;
        char bootLine[192];
        boot_diag::format(bootLine, sizeof(bootLine), bootRc, hs, loopHwm, renderHwm);
        Serial.println(bootLine);
    }
}

// ---------------------------------------------------------------------------
// loop() — called repeatedly
// ---------------------------------------------------------------------------
void loop() {
    RTMON_LOOP_BEGIN();
    unsigned long now = millis();

    // R-3 hardening: emit stack high-watermark for both FreeRTOS tasks
    // every 5 s.  Pure instrumentation — uxTaskGetStackHighWaterMark
    // is non-blocking and reports the minimum free stack (in words on
    // ESP-IDF FreeRTOS) seen since task creation.  No stack sizes are
    // changed; this only makes silent overflow risk observable.
    {
        static uint32_t s_lastStackHwmLogMs = 0;
        if ((now - s_lastStackHwmLogMs) >= 5000UL) {
            s_lastStackHwmLogMs = now;
            UBaseType_t loopHwm   = uxTaskGetStackHighWaterMark(nullptr);
            UBaseType_t renderHwm = (renderTaskHandle != nullptr)
                                  ? uxTaskGetStackHighWaterMark(renderTaskHandle)
                                  : 0;
            Serial.printf("[STACK] loop_hwm=%u render_hwm=%u\n",
                          (unsigned)loopHwm, (unsigned)renderHwm);
        }
    }

    // ---- Bench/manual TFT recovery request (audit P2 §4.2) ----
    // The white screen is NOT automatically observable with the current wiring
    // (no reliable readback, no reset-signal latch), so an operator on the
    // bench can explicitly request a recovery by sending 'R' (or 'r') over the
    // USB serial console.  This sets a flag consumed by the supervisor block
    // below, which forces a confirmed loss and drives the Core-0 choreography.
    while (Serial.available() > 0) {
        int c = Serial.read();
        if (c == 'R' || c == 'r') {
            g_manualRecoveryRequest = true;
            Serial.println("[DISPLAY][RECOVERY] manual/bench request received");
        }
    }

    // ---- Display supervisor + recovery orchestration (audit P2) ----
    // Core-1 does DETECTION only and, when a recovery is warranted, REQUESTS it
    // from the Core-0 render task (which owns the SPI bus).  Core 1 NEVER calls
    // TFT_eSPI.  Readback is reported as UNSUPPORTED here because the ST7796
    // panel cannot be read back reliably with the current wiring, so a stalled
    // render heartbeat is honestly classified as RENDER_STALLED (an observable
    // fact) — never asserted as "pantalla blanca confirmada".  A bench/manual
    // request (g_manualRecoveryRequest) exists precisely because the white
    // screen is NOT automatically observable with this hardware.
    {
        static display::Supervisor s_dispSup;
        static uint32_t s_lastDispEvalMs = 0;
        static display::State s_lastDispState = display::State::OK;
        static bool s_recoveryPosted = false;
        const uint32_t kRenderStaleMs = 500;  // mirrors Config::render_stale_ms

        // First, finalise any recovery the render task has already completed so
        // the supervisor's counters / backoff stay consistent.
        {
            bool ok = false; uint32_t dur = 0;
            bool haveResult;
            taskENTER_CRITICAL(&g_recoveryMux);
            haveResult = g_recoveryMailbox.takeResult(ok, dur);
            taskEXIT_CRITICAL(&g_recoveryMux);
            if (haveResult) {
                // Walk the pure FSM through its hardware stages, then complete.
                s_dispSup.advanceRecovery((uint32_t)now);   // -> RESETTING
                s_dispSup.advanceRecovery((uint32_t)now);   // -> REINITIALIZING
                s_dispSup.advanceRecovery((uint32_t)now);   // -> REDRAWING
                s_dispSup.completeRecovery((uint32_t)now, ok);
                s_recoveryPosted = false;
                Serial.printf("[DISPLAY][RECOVERY] finalised — %s (%lu ms) | "
                              "estado=%s recuperaciones=%lu fallidas=%lu\n",
                              ok ? "OK" : "FALLIDA", (unsigned long)dur,
                              display::stateText(s_dispSup.state()),
                              (unsigned long)s_dispSup.recoveryCount(),
                              (unsigned long)s_dispSup.recoveryFailCount());
            }
        }

        if ((now - s_lastDispEvalMs) >= 100UL) {
            s_lastDispEvalMs = now;

            const bool manual = g_manualRecoveryRequest;
            const bool reset_latched = g_tftResetSignalLatched;

            // A manual/bench request forces a confirmed loss so the FSM opens a
            // recovery attempt (the white screen is otherwise not observable).
            if (manual && !s_dispSup.recovering() &&
                s_dispSup.state() != display::State::RECOVERY_FAILED) {
                s_dispSup.forceFault(
                    (uint32_t)now,
                    display::recoveryTriggerToFault(
                        display::RecoveryTrigger::RECOVERY_MANUAL_REQUEST));
            }
            g_manualRecoveryRequest = false;

