florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
            display::State st = s_dispSup.update(
                (uint32_t)now,
                (uint32_t)renderHeartbeatMs,
                display::StatusRead::UNSUPPORTED,
                (uint32_t)ESP.getFreeHeap());

            // When the FSM asks for a recovery, classify the trigger honestly
            // and post the request to Core 0 (once per attempt).
            if (st == display::State::RECOVERY_REQUESTED && !s_recoveryPosted) {
                const bool render_stale =
                    (uint32_t)(now - renderHeartbeatMs) >= kRenderStaleMs;
                display::RecoveryTrigger trig = display::classifyRecoveryTrigger(
                    manual, reset_latched,
                    display::StatusRead::UNSUPPORTED, render_stale);
                if (requestDisplayRecovery(trig)) {
                    s_recoveryPosted = true;
                    Serial.printf("[DISPLAY][RECOVERY] requested from Core 1 — "
                                  "trigger: %s | observable=%s\n",
                                  display::recoveryTriggerText(trig),
                                  display::whiteScreenObservable(false, reset_latched)
                                      ? "si" : "no");
                }
            }

            if (st != s_lastDispState) {
                if (st == display::State::CONFIRMED_LOST) {
                    display::Fault f = s_dispSup.lastFault();
                    display::RecoveryBannerInfo info{};
                    info.cause            = f;
                    info.duration_ms      = 0;
                    info.attempts         = s_dispSup.attempts();
                    info.render_continued = false;
                    info.esp32_rebooted   = false;
                    info.free_heap        = (uint32_t)ESP.getFreeHeap();
                    info.total_recoveries = s_dispSup.recoveryCount();
                    Serial.printf("[DISPLAY] fault suspected: %s | %s\n",
                                  display::faultText(f),
                                  display::recoveryActionText(info));
                } else if (st == display::State::RECOVERY_FAILED) {
                    Serial.printf("[DISPLAY][RECOVERY] FAILED after %u attempts — "
                                  "manual intervention required\n",
                                  (unsigned)s_dispSup.attempts());
                }
                s_lastDispState = st;
            }
        }
    }

    // Poll CAN RX and decode incoming frames
    RTMON_CAN_BEGIN();
    can_rx::poll(vehicleData);
    RTMON_CAN_END();

    // Check for pending ACK (non-blocking)
    ackCheck(vehicleData);

    // ---- Sync mode flags from STM32 heartbeat echo ----
    // The STM32 echoes the active mode flags in the heartbeat status_flags
    // (bits 1-2).  This allows the ESP32 to confirm the STM32 actually
    // applied the requested mode, even if the ACK was lost.
    // §1 CAN state validation: this is the SOLE source of truth for UI mode
    // state.  Tank turn and traction toggles only send CAN commands — the UI
    // updates here after the STM32 confirms via heartbeat echo.
    // Guard: only sync after first valid heartbeat has been received
    // (timestampMs is 0 until the first CAN heartbeat is decoded).
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t confirmedFlags = (hb.statusFlags >> 1) & 0x03;
            if (confirmedFlags != currentModeFlags) {
                currentModeFlags = confirmedFlags;
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                // Persist confirmed tank turn state to NVS
                config_store::setDriveMode(currentModeFlags & can::MODE_FLAG_TANK_TURN);
            }
        }
    }

    // ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
    // Verify the STM32 alive counter is incrementing each heartbeat period.
    // A frozen STM32 (timer ISR alive but main loop stuck) would send the same
    // counter value indefinitely — treat it as non-responsive after the freeze
    // threshold and inhibit further motion commands from this node.
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            // Evaluate the alive counter only when a NEW heartbeat frame has
            // been decoded (tracked via hb.timestampMs).  This prevents the
            // same sample from being counted repeatedly while loop() spins far
            // faster than the ~100 ms heartbeat period (root cause of the
            // FALSE "STM32 frozen" detection).  A time-based absence timeout
            // covers the "no new heartbeat at all" case.
            stm32Liveness.update((uint32_t)hb.timestampMs, hb.aliveCounter, (uint32_t)now);
            stm32IsAlive = stm32Liveness.isAlive();
            if (stm32Liveness.consumeFrozenEdge() &&
                (now - stm32FrozenWarnLastMs) >= STM32_FROZEN_WARN_INTERVAL_MS) {
                stm32FrozenWarnLastMs = now;
                Serial.println("[SAFETY][WARN] STM32 heartbeat counter frozen — inhibiting commands");
            }

            // ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
            // Detect startup_inhibit bit (statusFlags bit 0): 0→1 = STM32 just restarted.
            // When the bit later clears (0) AND state is ACTIVE, re-send the current gear
            // so the STM32 and shifter are synchronised.  Guards against the default
            // GEAR_FORWARD mis-match if the driver had previously selected PARK or REVERSE.
            bool startupInhibitNow = (hb.statusFlags & 0x01u) != 0;
            if (startupInhibitNow && !stm32StartupSeen) {
                // Rising edge of startup_inhibit → STM32 just booted/reset
                stm32StartupSeen    = true;
                gearResyncPending   = true;
                tempMapResyncPending = true;
                // The STM32 restarted → whatever drive mode it last confirmed
                // is stale.  Invalidate the ModeSync confirmation so the
                // physical selector's mode is RE-TRANSMITTED even if it equals
                // the previously-confirmed value (root cause of a confirmed
                // 4x4 never being resent after an STM32 restart).
                g_modeSync.invalidateConfirmed();
                Serial.println("[SAFETY][INFO] STM32 restart detected — gear + temp-map resync pending");
            }
            if (gearResyncPending && !startupInhibitNow &&
                hb.systemState == can::SystemState::ACTIVE && stm32IsAlive) {
                // STM32 is now in ACTIVE with no startup inhibit — send current gear
                uint8_t curGear = shifter::getGearRaw();
                sendGearCommand(curGear);
                lastSentGear    = curGear;  // prevent duplicate send from shifter loop
                gearResyncPending = false;
                Serial.printf("[SAFETY][INFO] Gear resync sent: gear=%u\n", curGear);
            }
            // Re-send the DS18B20 physIdx→role mapping after STM32 restart so
            // the STM32's in-RAM map matches the user's saved assignment.
            // Sent in STANDBY or ACTIVE (STM32 can receive it in either state).
            if (tempMapResyncPending && !startupInhibitNow && stm32IsAlive) {
                const auto& cfg = config_store::get();
                CanFrame frame = {};
                frame.identifier       = can::CMD_SENSOR_MAP_TEMP;
                frame.extd             = 0;
                frame.data_length_code = config_store::NUM_TEMP_SENS;
                for (uint8_t i = 0; i < config_store::NUM_TEMP_SENS; ++i) {
                    frame.data[i] = cfg.tempSensorMap[i];
                }
                ESP32Can.writeFrame(frame, 0);
                tempMapResyncPending = false;
                Serial.println("[SAFETY][INFO] DS18B20 sensor map resync sent to STM32");
            }
            if (!startupInhibitNow) {
                stm32StartupSeen = false;  // inhibit cleared, ready for next detection
            }

