florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
            // ---- Drive-mode confirmation from the heartbeat echo ----
            // The STM32 heartbeat echoes its applied drive mode (statusFlags
            // bit1 = 4x4, bit2 = tank turn).  Feed it into ModeSync as remote
            // confirmation so a selected mode still confirms even when the
            // CMD_ACK for our CMD_MODE was lost, and so a silent STM32 mode
            // revert is re-synchronised.  Processed once per NEW heartbeat
            // frame (tracked via hb.timestampMs) and only while the link is
            // proven alive.  Map STM32 statusFlags bits → CMD_MODE flag bits.
            if (stm32IsAlive &&
                (uint32_t)hb.timestampMs != (uint32_t)g_lastModeEchoTs) {
                g_lastModeEchoTs = (unsigned long)hb.timestampMs;
                uint8_t echoFlags = 0;
                if (hb.statusFlags & 0x02u) echoFlags |= can::MODE_FLAG_4X4;
                if (hb.statusFlags & 0x04u) echoFlags |= can::MODE_FLAG_TANK_TURN;
                g_modeSync.onHeartbeatModeEcho(echoFlags);
            }

            // ---- One-shot LED relay restore from NVS after boot ----
            // If the front/rear LED strips were saved as ENABLED, power them
            // up automatically once the STM32 is alive and out of BOOT — the
            // user should NOT have to press the button after boot.  An explicit
            // OFF state (both false) is respected: nothing is sent.  Only the
            // LED relays are touched (CMD_LED); traction/steering relays are
            // never affected here.  Retries (rate-limited, bounded) until the
            // STM32 echoes the desired relay state so a dropped CAN frame can't
            // silently leave the strips off.
            if (!ledBootRestoreDone && stm32IsAlive &&
                (hb.systemState == can::SystemState::STANDBY ||
                 hb.systemState == can::SystemState::ACTIVE)) {
                if (!frontLedLocalState && !rearLedLocalState) {
                    ledBootRestoreDone = true;  // OFF saved — respect it, nothing to do
                } else if (vehicleData.lights().frontRelayOn == frontLedLocalState &&
                           vehicleData.lights().rearRelayOn  == rearLedLocalState) {
                    ledBootRestoreDone = true;  // STM32 already reflects saved state
                } else if (ledBootRestoreAttempts >= LED_BOOT_RESTORE_MAX_ATTEMPTS) {
                    ledBootRestoreDone = true;  // give up after bounded retries
                } else if ((now - ledBootRestoreLastMs) >= LED_BOOT_RESTORE_RETRY_MS) {
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    ledBootRestoreLastMs = now;
                    ledBootRestoreAttempts++;
                    Serial.printf("[LED] Boot restore from NVS (try %u) → front=%s rear=%s\n",
                                  ledBootRestoreAttempts,
                                  frontLedLocalState ? "ON" : "OFF",
                                  rearLedLocalState ? "ON" : "OFF");
                }
            }
        }
    }

    // Update obstacle sensor and transmit CAN 0x208
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t speedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            speedSum += vehicleData.speed().raw[i];
        }
        float speedKmh = static_cast<float>(speedSum) / 4.0f * 0.1f;
        obstacle_sensor::update(speedKmh);
        can_obstacle::update();

        // Update VehicleData with latest sensor reading for HMI display.
        // distanceCm = 0 maps to "---" in the UI, signalling no valid reading.
        // Use 0 when the sensor is unhealthy (fault/stuck/timeout) so the
        // display shows "---" instead of a misleading "0.02 m" fallback value.
        obstacle_sensor::Reading rd = obstacle_sensor::getReading();
        vehicle::ObstacleData od;
        od.distanceCm  = rd.healthy ? (rd.distance_mm / 10) : 0;
        od.timestampMs  = millis();
        vehicleData.setObstacle(od);
    }

    // ---- Update shared vehicle data for render task (Core 0) ----
    // Non-blocking: skip if render task holds the mutex (stale-by-one-frame is OK).
    if (vdMutex != nullptr && xSemaphoreTake(vdMutex, 0) == pdTRUE) {
        renderVD = vehicleData;
        xSemaphoreGive(vdMutex);
    }

    // Poll iBUS parser (no-op only when REMOTE_CONTROL_ENABLED=0) and compute
    // unified LOCAL/REMOTE arbitration gates for all RC-driven subsystems.
    remote_control::update();
    const bool remoteAuthorityActive =
        stm32IsAlive &&
        remote_control::isRemoteSelected() &&
        remote_control::getState() == remote_control::State::ACTIVE;
    const bool remoteMotionAuthorityActive =
        remoteAuthorityActive && !remote_control::isKillSwitchActive();

    // ---- Shifter gear update ----
    // Poll shifter + RC CH7 and send CAN 0x102 on authoritative source change.
    {
        shifter::update();
        uint8_t gear = remoteMotionAuthorityActive
                     ? remote_control::getRequestedGear()
                     : shifter::getGearRaw();
        if (gear != lastSentGear &&
            (now - lastGearSendMs) >= GEAR_SEND_DEBOUNCE_MS &&
            stm32IsAlive) {
            lastSentGear   = gear;
            lastGearSendMs = now;
            sendGearCommand(gear);
            // Play specific gear announcement
            switch (static_cast<shifter::Gear>(gear)) {
                case shifter::Gear::PARK:       audio::play(audio::Sound::GEAR_PARK,    audio::Priority::LO); break;
                case shifter::Gear::REVERSE:    audio::play(audio::Sound::GEAR_REVERSE, audio::Priority::LO); break;
                case shifter::Gear::NEUTRAL:    audio::play(audio::Sound::GEAR_NEUTRAL, audio::Priority::LO); break;
                case shifter::Gear::FORWARD:    audio::play(audio::Sound::GEAR_D1,      audio::Priority::LO); break;
                case shifter::Gear::FORWARD_D2: audio::play(audio::Sound::GEAR_D2,      audio::Priority::LO); break;
            }
            Serial.printf(remoteMotionAuthorityActive // flawfinder: ignore
                              ? "[REMOTE] Gear(CH7) → %u\n"
                              : "[SHIFTER] Gear → %u\n",
                          gear);
        }
    }

