florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    /* ---- TWAI bus-off / error-passive recovery ----
     * If the ESP32 transmits before the STM32 starts (or after a bus
     * glitch), the TWAI controller enters BUS_OFF after TEC reaches 256.
     * Without recovery the ESP32 stays dead permanently.
     *
     * Recovery sequence (per ESP-IDF TWAI API):
     *   BUS_OFF → twai_initiate_recovery() → RECOVERING
     *   RECOVERING → (128×11 recessive bits) → STOPPED
     *   STOPPED → twai_start() → RUNNING (probation)
     *   RUNNING → sustained advancing STM32 heartbeats → recovery CONFIRMED
     *
     * The bus-off recovery decision is delegated to the pure, host-tested
     * twai_recovery::TwaiBusOffRecovery FSM (esp32/src/twai_recovery.h): the
     * controller merely reporting RUNNING is treated as PROBATION, not health,
     * so the photographed BUS_OFF↔RUNNING oscillation cannot falsely reset the
     * counters.  Retries are fast-then-slow (unbounded) so the node always
     * recovers after a physical reconnection, and the lifetime BUS_OFF count is
     * preserved.
     *
     * Error-passive recovery (two-phase):
     *   When TEC saturates at 128 (error-passive) the TWAI state remains
     *   RUNNING so bus-off recovery never triggers.  If error-passive
     *   persists for the timeout period, a full driver reinit
     *   (stop → uninstall → install → start) clears error counters.
     *   Phase 1: first 10 attempts at 3 s intervals (fast).
     *   Phase 2: unlimited attempts at 30 s intervals (slow periodic).
     *
     * Check every 250 ms. */
    if (now - lastBusOffCheckMs >= 250) {
        lastBusOffCheckMs = now;
        twai_status_info_t sts;
        if (twai_get_status_info(&sts) == ESP_OK) {
            // Map the ESP-IDF controller state to the pure-logic enum.
            twai_recovery::TwaiState st;
            switch (sts.state) {
                case TWAI_STATE_BUS_OFF:    st = twai_recovery::TwaiState::BUS_OFF;    break;
                case TWAI_STATE_RECOVERING: st = twai_recovery::TwaiState::RECOVERING; break;
                case TWAI_STATE_STOPPED:    st = twai_recovery::TwaiState::STOPPED;    break;
                default:                    st = twai_recovery::TwaiState::RUNNING;    break;
            }

            // Stable-heartbeat recovery FSM: RUNNING alone never confirms and
            // never resets counters — only sustained advancing STM32 heartbeats
            // (stm32IsAlive) confirm recovery.
            twai_recovery::TwaiAction act = g_twaiRecovery.update(now, st, stm32IsAlive);
            switch (act) {
                case twai_recovery::TwaiAction::INITIATE_RECOVERY:
                    Serial.printf("[CAN][ERR] BUS_OFF — recovery attempt %u "
                                  "(lifetime bus-off #%lu)\n",
                                  g_twaiRecovery.attempts(),
                                  (unsigned long)g_twaiRecovery.lifetimeBusOffCount());
                    twai_initiate_recovery();
                    break;
                case twai_recovery::TwaiAction::START:
                    if (twai_start() == ESP_OK) {
                        Serial.println("[CAN][INFO] Driver restarted — awaiting "
                                       "sustained STM32 heartbeats to confirm recovery");
                    }
                    break;
                case twai_recovery::TwaiAction::CONFIRMED:
                    Serial.printf("[CAN][INFO] BUS_OFF recovery CONFIRMED — "
                                  "stable heartbeat window sustained (recoveries=%lu)\n",
                                  (unsigned long)g_twaiRecovery.confirmedRecoveries());
                    break;
                case twai_recovery::TwaiAction::NONE:
                default:
                    break;
            }

            if (sts.state != TWAI_STATE_RUNNING) {
                errorPassiveSince = 0;  // not error-passive unless RUNNING
            } else {
                /* ---- Error-passive detection (two-phase) ----
                 * TEC ≥ 128 means the controller is error-passive.  It can
                 * still receive but transmissions are degraded.  If this
                 * persists, a full driver reinit is the only way to clear
                 * the error counters (twai_initiate_recovery() is only
                 * valid from BUS_OFF state).
                 *
                 * Phase 1 (fast):  first ERROR_PASSIVE_MAX_FAST attempts
                 *                  at ERROR_PASSIVE_TIMEOUT_MS intervals.
                 * Phase 2 (slow):  unlimited attempts at
                 *                  ERROR_PASSIVE_SLOW_TIMEOUT_MS intervals. */
                if (sts.tx_error_counter >= 128) {
                    bool slowPhase = (errorPassiveResets >= ERROR_PASSIVE_MAX_FAST);
                    uint32_t timeout = slowPhase
                                     ? ERROR_PASSIVE_SLOW_TIMEOUT_MS
                                     : ERROR_PASSIVE_TIMEOUT_MS;

                    if (errorPassiveSince == 0) {
                        errorPassiveSince = now;
                    } else if ((now - errorPassiveSince) >= timeout) {
                        if (slowPhase) {
                            Serial.printf("[CAN][WARN] Error-passive (tx_err=%lu) "
                                          "— slow-periodic reinit (%lu s cycle)\n",
                                          (unsigned long)sts.tx_error_counter,
                                          (unsigned long)(ERROR_PASSIVE_SLOW_TIMEOUT_MS / 1000));
                        } else {
                            Serial.printf("[CAN][WARN] Error-passive (tx_err=%lu) for >3s "
                                          "— reinit attempt %u/%u\n",
                                          (unsigned long)sts.tx_error_counter,
                                          errorPassiveResets + 1,
                                          ERROR_PASSIVE_MAX_FAST);
                        }
                        esp_err_t stop_res = twai_stop();
                        if (stop_res != ESP_OK &&
                            stop_res != ESP_ERR_INVALID_STATE) {
                            Serial.printf("[CAN][ERR] twai_stop() failed: 0x%x\n",
                                          (unsigned)stop_res);
                        } else {
                            esp_err_t uninst_res = twai_driver_uninstall();
                            if (uninst_res != ESP_OK &&
                                uninst_res != ESP_ERR_INVALID_STATE) {
                                Serial.printf("[CAN][ERR] twai_driver_uninstall() "
                                              "failed: 0x%x\n",
                                              (unsigned)uninst_res);
                            } else if (twaiInit()) {
                                Serial.println("[CAN][INFO] Error-passive recovery "
                                               "complete — TWAI reinitialized");
                            } else {
                                Serial.println("[CAN][ERR] Error-passive recovery "
                                               "FAILED — TWAI reinit error");
                            }
                        }
                        errorPassiveResets++;
                        errorPassiveSince = 0;
                    }
                } else {
                    /* TEC below error-passive threshold — healthy */
                    errorPassiveSince  = 0;
                    errorPassiveResets = 0;
                }
            }
        }
    }

#if RUNTIME_MONITOR
    // Runtime monitor serial log every LOG_INTERVAL_MS
    if (now - lastRtMonMs >= rtmon::LOG_INTERVAL_MS) {
        lastRtMonMs = now;
        RTMON_LOG();
    }
#endif
    RTMON_LOOP_END();

    vTaskDelay(1);  // Yield Core 1 — let TWAI driver, idle task, and system housekeeping run
}
